## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["talos-testing-cp01.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.22/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-cp01"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-cp02.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.23/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-cp02"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-cp03.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.24/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-cp03"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-haproxy.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone                  = "ubuntu24-cloudinit"
      + clone_wait             = 10
      + cores                  = 1
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.28/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 1024
      + name                   = "haproxy-testing"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node01"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "8G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-w01.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.25/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-w01"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-w02.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.26/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-w02"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["talos-testing-w03.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 0
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.27/24,gw=192.168.1.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "talos-testing-w03"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "stopped"
      + vmid                   = (known after apply)

      + disk {
          + backup               = true
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso"
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = (known after apply)
          + slot                 = "ide2"
          + type                 = "cdrom"
        }
      + disk {
          + backup               = true
          + format               = "raw"
          + id                   = (known after apply)
          + iops_r_burst         = 0
          + iops_r_burst_length  = 0
          + iops_r_concurrent    = 0
          + iops_wr_burst        = 0
          + iops_wr_burst_length = 0
          + iops_wr_concurrent   = 0
          + linked_disk_id       = (known after apply)
          + mbps_r_burst         = 0
          + mbps_r_concurrent    = 0
          + mbps_wr_burst        = 0
          + mbps_wr_concurrent   = 0
          + passthrough          = false
          + size                 = "50G"
          + slot                 = "scsi0"
          + storage              = "data2"
          + type                 = "disk"
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ vm_ips            = {
      + talos-testing-cp01    = "ip=192.168.1.22/24,gw=192.168.1.1"
      + talos-testing-cp02    = "ip=192.168.1.23/24,gw=192.168.1.1"
      + talos-testing-cp03    = "ip=192.168.1.24/24,gw=192.168.1.1"
      + talos-testing-haproxy = "ip=192.168.1.28/24,gw=192.168.1.1,ip6=dhcp"
      + talos-testing-w01     = "ip=192.168.1.25/24,gw=192.168.1.1"
      + talos-testing-w02     = "ip=192.168.1.26/24,gw=192.168.1.1"
      + talos-testing-w03     = "ip=192.168.1.27/24,gw=192.168.1.1"
        # (7 unchanged attributes hidden)
    }

  ```
  
  Plan exit code: 0
  